app/controllers/cards_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
  def edit
    @status = 'hide'
    @card = Card.find(params[:id])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
UPDATE "cards" SET "translated_text" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["translated_text", "23чуауачуач"], ["updated_at", 2016-11-07 20:28:48 UTC], ["id", 69]]
---
  def update
    @card = Card.find(params[:id])
    @card.update(card_params)

INSERT INTO "cards" ("original_text", "translated_text", "review_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["original_text", "vdvdvdv"], ["translated_text", "scssvsvsv"], ["review_date", Sat, 05 Nov 2016], ["created_at", 2016-11-07 11:18:31 UTC], ["updated_at", 2016-11-07 11:18:31 UTC]]
---
  def create
    @card = Card.new(card_params)
    @card.update(:review_date => $date_mark)
     if @card.save

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 64]]
---
  def destroy
    @card = Card.find(params[:id])
    @card.destroy