app/controllers/home_controller.rb

  def index
    @card = Card.review_date_earlier_or_equal.random.first
---
SELECT "cards".* FROM "cards"